api-management/apis/myservice__1[Current]/operations/POST___soapAction=http___m1K7QZ62.request.text_xml.html

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <MyServiceFindRequestRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://mynamespace">
      <_args>
        <RequestId xmlns="http://schemas.datacontract.org/2004/07/Dynamics.Ax.Application">RequestId1</RequestId>
      </_args>
      <_languageID>_languageID1</_languageID>
    </MyServiceFindRequestRequest>
  </Body>
</Envelope>